Revit 2024 API
Alignment.StartStation Property
 Specifies the station at which the alignment's geometric definition starts, in Revit internal model units (standard Imperial feet).
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public double StartStation { get; }
Visual Basic
Public ReadOnly Property StartStation As Double
	Get
Visual C++
public:
property double StartStation {
	double get ();
}
Remarks
 This station may be outside the displayed range (DisplayedStartStation, DisplayedEndStation).
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace